#+TITLE: Get Things Done
#+STARTUP: overveiw
#+STARTUP: hidestars align fold nodlcheck oddeven lognotestate
#+STARTUP: logdone
#+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %5Effort(Time){:} %6CLOCKSUM{Total}
#+PROPERTY: Effort_ALL 0 0:10 0:20 0:30 1:00 2:00 3:00 4:00 8:00
#+TAGS:       Study(s) Project(p) Fix(f) Check(c) 

* Tasks
  :PROPERTIES:
  :CATEGORY: TASKS
  :END:
** WiFI Driver持续学习(mt76x2)
    SCHEDULED: <2016-08-29 周一 +1w>
*** Green AP
    - Next Action: 
      LinuxDriver Green AP - RLT MAC
      MT7603_GreenAP_Unify_MAC

*** TPUT_study
*** WoW
    - Next Action:
      WoW_MTxxxx_Intro_20141125

*** Smart Connection
    - Next Action:
      MT7687 - Smart Connection Introduction .pptx

*** USB
    - Next Action:
      usb_study_report_junqi_2_USB Driver Register.pdf

*** Date Rate Alg
** mt7668驱动学习
    SCHEDULED: <2016-08-29 周一 +1w>
    
*** ☛ TODO [#B] DBDC

*** ☛ TODO [#C] CR4 and PDMA

*** ☛ TODO [#C] HIF

*** ☛ TODO [#C] Security
*** ☛ TODO [#B] cfg80211
*** ☛ TODO [#C] Low power and WOW

>>>>>>> 2ce2cc088f9810992052e5c74f211d6484be1bb4
*** ☛ TODO [#C] BF/MU/RA/Calibration
    
*** ☛ TODO [#B] FW

*** ☛ TODO [#C] Roaming

** 802.11ac
   http://chimera.labs.oreilly.com/books/1234000001739/index.html
   
*** MAC层

*** 11ac中的BF
*** ☛ TODO 物理层                                                         :802.11ac学习:
** emacs
*** 工作流优化
**** ☛ TODO 任务开始时，自动计时
     参考代码：
     #+BEGIN_SRC emacs-lisp
        (setq org-log-done 'time)
          (defadvice org-clock-in (after wicked activate)
       "Mark STARTED when clocked in"
       (save-excursion
         (catch 'exit
           (org-back-to-heading t)
           (if (looking-at org-outline-regexp) (goto-char (1- (match-end 0))))
           (if (looking-at (concat " +" org-todo-regexp "\\( +\\|[ \t]*$\\)"))
               (org-todo "STARTED")))))     
     #+END_SRC
**** ☛ TODO 绽放时，显示等号的字体要同比例进行绽放
** 技术修炼
    SCHEDULED: <2016-08-29 周一 +1w>
*** 读书计划
**** Learn More Study Less
**** 突破思维的障碍
**** 专注力
**** 一万小时天才理论
**** 成功者的大脑
**** Break-Throuhgh Rapid Reading
**** 提早六小时下班的高效工作术
*** 技术书箱
**** Digital Communication Systems
     http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-02-introduction-to-eecs-ii-digital-communication-systems-fall-2012/index.htm
**** 编译原理（龙书）
** 编程语言捂热计划
*** 网络编程
*** C++
**** ☛ TODO 阅读C++ Concurrency in Action
**** 阅读C++编程的55个好习惯
**** cpluff
**** Google Fruit库研究
      https://github.com/google/fruit.git
*** Java
**** Guice库研究
      https://github.com/google/guice.git
**** Freemind工具研究
***** ☛ TODO 在Tab页中添加支持双击关闭的功能
*** Android
**** Android Adventures - Mastering Fragments
     http://www.i-programmer.info/ebooks/android-adventures-mastering-fragments.html
**** Android
     http://www.i-programmer.info/programming/android.html
*** Javascript
**** 学习"Javascript Data Structures - Stacks, Queue and Deque"
     http://www.i-programmer.info/programming/javascript/1674-javascript-data-structures-stacks-queues-and-deques.html
>>>>>>> 2ce2cc088f9810992052e5c74f211d6484be1bb4
*** Python
**** 学习Python基本的网络编程方法
**** https://automatetheboringstuff.com/
** 个人开发需求
*** Wifi Debug Program                                               :PROJECT:
**** 当前Action： 搭建应用程序的基本UI界面
**** WiFi
***** ☛ TODO 显示AP列表
***** ☛ TODO 连接AP
**** P2P
***** ☛ TODO 支持WiFi直连
**** Miracast
***** ☛ TODO 支持设备投屏操作
** 开源工具
   1. simple screen recoder
   2. Dia
   3. Childsplay
** ☛ TODO WireShark学习目标
*** Wireshark分析数据包 [0/9]
    - [ ] TCP/IP数据包
    - [ ] DNS
    - [ ] DHCP
    - [ ] WLAN 802.11
    - [ ] Chapter 29
    - [ ] Chapter 30
    - [ ] Chapter 31
    - [ ] Chapter 32
    - [ ] Chapter 33 (command tools)
** ⚑ WAITING CWTS学习                                                 :Study:
CWTS学习， 内容属性简单级别
Added: [2016-08-10 周三 13:40]
** ⚑ WAITING CWSP学习                                                 :Study:
    SCHEDULED: <2016-09-19 周一>
808.11 Security相关的知识学习
Added: [2016-08-10 周三 13:40]
** ☛ TODO  吞吐量问题分析SOP学习                                  :Study:
    SCHEDULED: <2016-10-10 周一>
TPUT_study
Added: [2016-08-10 周三 13:45]
** ☛ TODO [#C] 处理云笔记                                             :Study:
    SCHEDULED: <2016-08-29 周一 +1w>
    CLOCK: [2016-08-18 周四 18:02]--[2016-08-18 周四 18:23] =>  0:21
    CLOCK: [2016-08-18 周四 09:12]--[2016-08-18 周四 09:19] =>  0:07
    CLOCK: [2016-08-17 周三 19:25]--[2016-08-17 周三 19:40] =>  0:15

    Added: [2016-08-15 周一 13:15]

** ☛ TODO 深入理解Android：Wi-Fi、NFC和GPS卷阅读计划                   :Study:
    SCHEDULED: <2016-10-10 周一>
     1. [ ] 第二章  深入理解Netd
     2. [ ] 第三章  WiFi基础知识
     3. [ ] 第四章 深入理解wpa_supplicant
     4. [ ] 第五章 深入理解WifiService
     5. [ ] 第6章 深入理解Wi-Fi Simple Configuration
     6. [ ] 第7章 深入理解Wi-Fi P2P
Added: [2016-09-02 周五 14:15]
>>>>>>> 2ce2cc088f9810992052e5c74f211d6484be1bb4
** ☛ TODO Linux IPC机制研究                                            :Study:
    1. [[https://lwn.net/Articles/466304/][Fast interprocess communication revisited]]
    2. [[https://lwn.net/Articles/697191/][Bus1: a new Linux interprocess communication proposal]]
Added: [2016-09-07 周三 09:50]
** ☛ TODO Linux Trace API研究                                          :Study:
    
Added: [2016-09-09 周五 13:45]
<<<<<<< HEAD
** ☛ TODO 802.1X深入研究
     EAPOL 一些状态机的研究
** ☛ TODO SDIO规范阅读                                                 :Study:

Added: [2016-09-18 周日 00:15]
** ☛ TODO [#A] 办公桌6S整理                                           :Check:
    SCHEDULED: <2016-11-07 周一 +2w>
    - State "✔ DONE"     from "☛ TODO"     [2016-11-03 周四 16:20]
   - State "✔ DONE"     from "☛ TODO"     [2016-10-12 三 10:40]
   - State "✔ DONE"     from "☛ TODO"     [2016-09-27 二 09:25]
   - State "✔ DONE"     from "☛ TODO"     [2016-09-19 一 18:45]
    - State "✔ DONE"     from "☛ TODO"     [2016-09-12 周一 09:30]
    - State "✔ DONE"     from "☛ TODO"     [2016-09-05 周一 09:55]
   :PROPERTIES:
   :LAST_REPEAT: [2016-11-03 周四 16:18]
   :END:
    - 整理
      内容： 将工作现场的所有物品区分为有用品和无用品，除了有用的留下
      来，其它的都清理掉。

      目的：腾出空间，空间活用，防止误用，保持清爽的工作环境。

    - 整顿
      内容：把留下来的必要用的物品依规定位置摆放，并放置整齐加以标识。

      目的：工作场所一目了然，消除寻找物品的时间，整整齐齐的工作环境，
      消除过多的积压物品。

    - 清扫
      内容：将工作场所内看得见与看不见的地方清扫干净，保持工作场所干净、
      亮丽，创造良好的工作环境。 */

      目的： 稳定品质，减少工业伤害。

    - 清洁
      内容：将整理、整顿、清扫进行到底，并且制度化，经常保持环境处在整
      洁美观的状态。

      目的：创造明朗现场，维持上述3S推行成果。

    - 素养
      内容：每位成员养成良好的习惯，并遵守规则做事，培养积极主动的精神
      （也称习惯性）。

      目的： 促进良好行为习惯的形成，培养遵守规则的员工，发扬团队精神。

    - 安全
      内容：重视成员安全教育，每时每刻都有安全第一观念，防范于未然。

      目的： 建立及维护安全生产的环境，所有的工作应建立在安全的前提下。 
Added: [2016-09-05 周一 09:50]
** ☛ TODO 学习elisp tutorial
    DEADLINE: <2016-11-30 三> SCHEDULED: <2016-10-10 一>
** ☛ TODO 802.1X深入研究
     EAPOL 一些状态机的研究
>>>>>>> 2ce2cc088f9810992052e5c74f211d6484be1bb4
** ☛ TODO [#B] CWAP学习                                                :Study:
   DEADLINE: <2016-11-30 周三> SCHEDULED: <2016-10-17 一 +1w>
    - State "✔ DONE"    q from "☛ TODO"     [2016-09-18 周日 00:05]
    CLOCK: [2016-09-12 周一 19:09]--[2016-09-12 周一 20:15] =>  1:06
    - State "✔ DONE"     from "☛ TODO"     [2016-09-09 周五 09:25]
    - State "✔ DONE"     from "☛ TODO"     [2016-09-06 周二 20:40]
    CLOCK: [2016-09-01 周四 16:56]--[2016-09-01 周四 18:02] =>  1:06
    CLOCK: [2016-09-01 周四 16:04]--[2016-09-01 周四 16:25] =>  0:21
   :PROPERTIES:
   :LAST_REPEAT: [2016-09-18 周日 00:06]
   :END:
内容属性较难级别
     - [X] 第一章
     - [X] 第二章
     - [X] 第三章
     - [X] 第四章
     - [X] 第五章
     - [X] 第六章
     - [X] 第七章
     - [X] 第八章
     - [X] 第九章
     - [ ] 第十章
     - [X] 第十一章
     - [X] 第十二章
     - [ ] 第十一章
     - [ ] 第十二章

** ☛ TODO 学习mt76x2 WiKi上的案例分享信息
   SCHEDULED: <2016-10-17 一 +1w>
** ☛ TODO [#B] 数据结构与算法设计学习                                 :Study:
    SCHEDULED: <2016-09-19 周一 +1w>
    - State "✔ DONE"     from "☛ TODO"     [2016-09-18 周日 00:20]
   - State "✔ DONE"     from "☛ TODO"     [2016-09-10 六 16:10]
    CLOCK: [2016-09-10 六 14:31]--[2016-09-10 六 16:11] =>  1:40
    - State "✔ DONE"     from "☛ TODO"     [2016-09-04 周日 22:50]
    CLOCK: [2016-08-13 六 15:24]--[2016-08-13 六 16:04] =>  0:40
   :PROPERTIES:
   :Effort:   8:00
   :LAST_REPEAT: [2016-09-18 周日 00:20]
   :END:
    数据结构与常见算法思想学习
*** 编程珠矶
*** 算法设计手册
<<<<<<< HEAD
*** ☛ TODO 算法精解——C语言描述
**** 数据结构
          - [ ] 链表
          - [ ] 栈和队列
          - [ ] 集合
          - [ ] 哈希表
          - [ ] 树
          - [ ] 堆和优先队列
          - [ ] 图
          - [ ] 字符串

**** 算法
         - [ ] 搜索与排序         

**** 第八章 —— 线性表
**** 第九章 —— 树
**** 第十章 —— 二叉树
**** 第十一章 —— 搜索树
**** 第十二章 —— 堆和优先队列
**** 第十三章 —— 排序
**** 第十四章 —— 表
**** 第十五章 —— 集合
**** 第十六章 —— 图
Added: [2016-08-11 周四 13:25]

** ☛ TODO mac80211学习
    DEADLINE: <2016-12-31 周六> SCHEDULED: <2016-11-01 周二>
<<<<<<< HEAD

*** MT7601代码研究

** ⚑ WAITING MT7668内存管理研究                                       :Study:
      研究内存池的管理
Added: [2016-11-04 周五 16:40]
** ⚑ WAITING cfg80211 bss列表 的管理
      struct cfg80211_registered_device下面的bss_list代表当前网络接口
      保存的扫描结果列表 。
      bss_generation代数
      
>>>>>>> 2ce2cc088f9810992052e5c74f211d6484be1bb4
** ⚑ WAITING USB规范阅读                                              :Study:
    - [ ] Architectural Overview  
      本月内完成
    - [ ] 第4章
    - [ ] 第9章
    - [ ] 第十章
** ☛ TODO 研究MT7662 VHT的修改                                         :Study:
    SCHEDULED: <2016-12-09 周五>
    
    Added: [2016-12-08 周四 14:30]
** ☛ TODO ns-3工具研究与使用                                           :Study:
     重点了解如何 模拟WiFi的一些行为
     Added: [2017-01-16 周一 14:45]
** ☛ TODO 阅读Mobile and Wireless Communications Physical Layer Development and Implementatiom :Study:
      网址： http://www.intechopen.com/books/mobile-and-wireless-communications-physical-layer-development-and-implementatiom
Added: [2017-01-24 周二 17:25]
** ☛ TODO Common Lisp学习                                              :Study:
    https://www.cs.cmu.edu/Groups/AI/html/cltl/clm/node1.html
    下次看宏

    https://www.gnu.org/software/emacs/manual/html_mono/cl.html

    http://sixty-north.com/blog/writing-the-simplest-emacs-company-mode-backend

Added: [2017-02-08 周三 16:35]
** ☛ GOING [#B] 研究wpa_supplicant上的修改记录                         :Study:

* 本月必须启动的任务
** ☛ TODO The Art of Learning
   SCHEDULED: <2016-08-27 周六>
** ☛ TODO 计算机语言的构造与解释
   SCHEDULED: <2016-08-27 周六>
** ☛ TODO [#C] IW源码学习                                             :Study:
    SCHEDULED: <2016-09-19 周一>
   - Action: 熟悉iw命令的使用
** SDIO规范阅读
    - [ ] SDIO识卡流程
      驱动流程已经理清，下一步就是对照Spec跟读一下代码流程。

* Today GTD
  每日待办清单问题最多5个。

  7668驱动研究：
  1. 每天学习2个Change List。
  2. 按计划逐步学习代码流程。

  角色：
  1. CPL
  2. WiFi工程师
  3. 程序员
  
** Do Today [0/5]
*** ☛ TODO Soft Ap研究
**** DFS流程
*** ☛ TODO [#B] DBDC
*** ☛ TODO [#C] TCP-IP.Architecture.Design.and.Implementation.in.Linux.2008
     SCHEDULED: <2016-08-19 周五>
     CLOCK: [2016-08-16 周二 19:06]--[2016-08-16 周二 20:06] =>  1:00
     - [X] 第一章
     - [X] Netlink
     - [ ] PROTOCOL FUNDAMENTALS
    :END: 
     
** In Progress [1/2]
    
*** MT7668 QM机制研究
    CLOCK: [2017-03-16 周四 15:58]--[2017-03-16 周四 16:27] =>  0:29
    CLOCK: [2017-03-16 周四 15:22]--[2017-03-16 周四 15:53] =>  0:31
    CLOCK: [2017-03-16 周四 14:49]--[2017-03-16 周四 15:15] =>  0:26
    CLOCK: [2017-03-06 周一 14:48]--[2017-03-06 周一 15:20] =>  0:32
        1. TC-based HIF TX flow control
        2. adaptive TC quota adjustment
        3. HIF TX grant scheduling
        4. Power-Save forwarding control
        5. RX packet reordering
        6. RX BA agreement management
*** ☛ TODO SDIO Spec 
**** ☛ TODO 第一章 概述
     CLOCK: [2017-03-06 周一 16:22]--[2017-03-06 周一 16:48] =>  0:26
     
**** 第二章 SDIO信号定义
**** ☛ TODO 第三章 SDIO卡的初始化
     CLOCK: [2017-03-08 周三 14:43]--[2017-03-08 周三 19:00] =>  4:17
     CLOCK: [2017-03-08 周三 14:10]--[2017-03-08 周三 14:43] =>  0:33
     :PROPERTIES:
     :ORDERED:  t
     :END:
     
**** 第四章 与SD内存规范之间的差异
**** 第五章 新的I/O读写命令
**** 第六章 SDIO卡内部操作
**** 第七章 嵌入式I/O代码存储区域(CSA)
**** 第八章 SDIO中断
**** 第九章 SDIO Suspend/Resume操作
**** 第十章 暂停SDIO读操作的时序
**** 第十一章 电力控制 
**** 第十二章 高速模式
**** 第十三章 SDIO物理属性
**** 第十四章 SDIO功率
**** 第十五章 Inrush Current Limiting
**** 第十六章 CIS formats
**** 第十七章 Embedded SDIO

** Done [1/1]
** ☛ TODO PPT每日一练                                                 :Study:
    
Added: [2016-10-27 周四 19:00]
* STAR
** Situation
** Task
** Action
** Result
<<<<<<< HEAD
* 消除忧虑的方法
** 问题是什么？
    认清问题，理解问题，确认目标。
** 问题的成因是什么？
    调查事实，包括正面与反面的。
** 可能解决问题的方法有哪些？
    分析事实，总结在各种情况假设下的可能的解决方案。
** 你建议用哪一种方法？
    从候选的解决方案中选择最优的解决方案。
